[
  {
    "yearID": "year1800",
    "image": " voltaic-pile.svg",
    "text": " In 1800, Italian inventor Alessandro Volta developed the first practical method of generating electricity, the voltaic pile, which consists of discs of zinc, copper and salted wet cardboard being the predecessor of the modern battery."
  },
  {
    "yearID": "year1802",
    "image": " arch-lamp.svg ",
    "text": " In 1802 Humphry Davy, an English chemist and inventor, produced the world's first electric lamp by connecting voltaic piles to charcoal electrodes, the electric arc lamp."
  },
  {
    "yearID": "year1840",
    "text": " In 1840, British scientist Warren de la Rue developed an efficiently designed light bulb using a coiled platinum filament instead of copper."
  },
  {
    "yearID": "year1848",
    "text": " In 1848, Englishman William Staite improved the duration of conventional arc lamps by developing a clockwork mechanism that regulates the movement of the lamps. "
  },
  {
    "yearID": "year1850",
    "image": " swan-light-bulb.svg",
    "text": " In 1850, English chemist Joseph Swan tackled the cost-effectiveness problem of previous inventors."
  },
  {
    "yearID": "year1860",
    "text": " 1860 Joseph Swan had developed a light bulb that used carbonized paper filaments instead of ones made of platinum."
  },
  {
    "yearID": "year1878",
    "text": " 1878 Joseph Swan received a patent in the United Kingdom."
  },
  {
    "yearID": "year1879",
    "text": " In September of 1879 Joseph Swan demonstrated a working lamp in a lecture in Newcastle.",
    "text2": " In December of 1879 Thomas Edison demonstrated his light bulb with better modifications to Swan’s model that included a different filament."
  },
  {
    "yearID": "year1880",
    "image": " edisons-first-lamp.svg",
    "text": " In 1880 the two inventors eventually joined forces and formed Edison-Swan United, which became one of the world’s largest manufacturers of light bulbs, followed by the founding of the Edison Electric Illuminating Company in New York both having a huge success in commercialising the light bulb."
  }
]
